carbon/platform/branches/turing/components/mediation/mediation-library/connectors/org.wso2.carbon.connector.salesforce/4.2.0/src/main/resources/salesforce/logout.xml

<?xml version="1.0" encoding="UTF-8"?>
<template name="logout" xmlns="http://ws.apache.org/ns/synapse">
    <sequence>
        <property
            expression="get-property('operation','salesforce.serviceUrl')" name="uri.var.salesforce.url"/>
        <payloadFactory>
            <format>
                <soapenv:Envelope
                    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
                    <soapenv:Header>
                        <urn:SessionHeader>
                            <urn:sessionId>$1</urn:sessionId>
                        </urn:SessionHeader>
                    </soapenv:Header>
                    <soapenv:Body>
                        <urn:query>
                            <urn:logout/>
                        </urn:query>
                    </soapenv:Body>
                </soapenv:Envelope>
            </format>
            <args>
                <arg expression="get-property('operation','salesforce.sessionId')"/>
            </args>
        </payloadFactory>
        <property name="SOAPAction" scope="transport" value="urn:partner.soap.sforce.com/Soap/logoutRequest"/>
        <call>
            <endpoint>
                <http method="POST" uri-template="{uri.var.salesforce.url}"/>
            </endpoint>
        </call>
        <property name="salesforce.sessionId" scope="operation"
            type="STRING" value="" xmlns:ns="urn:partner.soap.sforce.com"/>
        <property name="salesforce.serviceUrl" scope="operation"
            type="STRING" value="" xmlns:ns="urn:partner.soap.sforce.com"/>
        <property name="salesforce.login.done" scope="operation"
            type="STRING" value="false"/>
    </sequence>
</template>
